<template>
	<div>
		<h1>Тестовое задание для ООО "ХайСмит"</h1>
		<p>Задача</p>
		<p>Необходимо разработать приложение по выводу новостной ленты http://static.feed.rbc.ru/rbc/logical/footer/news.rss. </p>
		<p>Требования к оформлению страницы:</p>

		<ul>
			<li>1. Шапка с заголовком приложения.</li>
			<li>2. Блок с фильтрами по дате и совпадению слов в заголовке новостей.
			<li>3. Список новостей: 
					a. Сортировка от более свежих к более старым 
					b. Каждая новость выводится в виде указания даты, заголовка и анонса. c. Заголовок новости кликабелен и ведет на отдельную страницу с конкретной новостью. 
					d. Лимит новостей на странице: не больше 5 штук. 
			</li>
			<li>4. Блок с пагинацией.</li>
		</ul>
		<p>Требования к оформлению страницы с конкретной новостью:</p>
		<ul>
			<li>1. Заголовок</li>
			<li>2. Блок с датой публикации и именем автора (если есть). </li>
			<li>3. Анонс новости.</li>
			<li>4. Список фотографий (если они есть). Вывод в виде слайдера с возможностью просмотра увеличенных изображений в попапе.</li>
			<li>5. Ссылка на оригинальную новость на сайте РБК.</li>
		</ul>
		<p>Требования:</p>
		<ul>
			<li>1. Стек: Vue.js, Nuxt.js, Vue Router.</li>
			<li>2. Визуальная часть на свое усмотрение. Плюсом будет использование библиотеки Vuetify или Element.</li>
		</ul>

		<nuxt-link to="news/">
			Ссылка на страницу с новостями
		</nuxt-link>
	</div>
</template>

<script>

export default {
  components: {
  }
}
</script>
